##### DataFrame 메서드 실습

In [1]:
import numpy as np
import pandas as pd

In [2]:
bank_client_df = pd.DataFrame({
    'Client ID': [1, 2, 3, 4],
    'Client Name': ['Aly', 'Steve', 'Nicole', 'Morris'],
    'Net worth [$]': [35000, 3000, 100000, 2000],
    'Years with bank': [4, 7, 10, 15]
})
bank_client_df

   Client ID Client Name  Net worth [$]  Years with bank
0          1         Aly          35000                4
1          2       Steve           3000                7
2          3      Nicole         100000               10
3          4      Morris           2000               15

In [3]:
# 문제 1. ID가 3인 고객 조회
bank_client_df[bank_client_df['Client ID'] == 3]

   Client ID Client Name  Net worth [$]  Years with bank
2          3      Nicole         100000               10

In [4]:
# 문제 2. 순자산(예치 금액)이 5,000달러가 넘는 고객 조회
bank_client_df[bank_client_df['Net worth [$]'] >= 5000]

   Client ID Client Name  Net worth [$]  Years with bank
0          1         Aly          35000                4
2          3      Nicole         100000               10

In [5]:
# 문제 3. 거래 기간이 5년 이상인 고객 조회
bank_client_df[bank_client_df['Years with bank'] >= 5]

   Client ID Client Name  Net worth [$]  Years with bank
1          2       Steve           3000                7
2          3      Nicole         100000               10
3          4      Morris           2000               15

In [12]:
# 문제 4. 이름이 S로 시작하는 고객 조회
bank_client_df[bank_client_df['Client Name'].str.contains('S')]

   Client ID Client Name  Net worth [$]  Years with bank
1          2       Steve           3000                7

In [14]:
# 문제 5. 거래 기간이 5년 이상이면서 이름이 S로 시작하는 고객 조회 (참고: and(&), or(|), not(~))
bank_client_df[(bank_client_df['Years with bank'] >= 5) & (bank_client_df['Client Name'].str.contains('S'))]

   Client ID Client Name  Net worth [$]  Years with bank
1          2       Steve           3000                7